#ifndef _CONFIGPIN_H
#define _CONFIGPIN_H
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include <Arduino.h>
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
typedef enum
{
  rpBroken, // штанга поломана или находится в промежуточной позиции
  rpUp, // в верхней позиции
  rpDown // в нижней позиции
} RodPosition; // позиция штанги
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class ConfigPin;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class ConfigPin
{

public:
  ConfigPin();
  static void setup();

  // возвращает true, если штанга в верхнем положении, false - если штанга в нижнем положении
  static RodPosition getRodPosition(uint8_t channelNumber);
  static bool RodUpEndstopTriggered();
  static bool RodDownEndstopTriggered();
  static void setI2CPriority(uint8_t priority);

 
private:


};
//--------------------------------------------------------------------------------------------------------------------------------------

#endif
