#pragma once
//--------------------------------------------------------------------------------------------------
#include <Arduino.h>
#include "CoreButton.h"
//--------------------------------------------------------------------------------------------------
class ButtonsList // список кнопок
{
  public:
  
    ButtonsList(); // конструктор
    void begin(); // начало работы
    void update(); // обновление внутреннего состояния

  private:
  
    Button redButton; // красная кнопка
    Button blueButton; // синяя кнопка
    Button yellowButton; // жёлтая кнопка

    bool inited; // флаг инициализации
    
};
//--------------------------------------------------------------------------------------------------
extern ButtonsList Buttons; // экземпляр класса
//--------------------------------------------------------------------------------------------------
