#pragma once
//--------------------------------------------------------------------------------------------------------------------------------
#include <Arduino.h>
//--------------------------------------------------------------------------------------------------------------------------------
extern void SetupEndstops(); // настраивает концевики
extern bool RodUpEndstopTriggered(bool noInt); // проверяет на срабатывание верхнего концевика, параметр - выключать или нет прерывания на время проверки
extern bool RodDownEndstopTriggered(bool noInt); // проверяет на срабатывание нижнего концевика, параметр - выключать или нет прерывания на время проверки
//--------------------------------------------------------------------------------------------------------------------------------
