#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#include <modbus.h>
#include <modbusDevice.h>
#include <modbusRegBank.h>
#include <modbusSlave.h>

#include "CONFIG.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// работа с MODBUS
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class ModbusHandler
{
  public:

    ModbusHandler();

    void setup();
    void begin();
    void update();


    // установка значения регистра
    void set(uint16_t reg, uint16_t val);

    // получение значения регистра
    uint16_t get(uint16_t reg);

    // установка ID слейва
    void setID(uint8_t id);

private:


  modbusDevice mbusRegBank;
  modbusSlave mbusSlave;


  void checkForChanges();
    
  
};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern ModbusHandler Modbus;
