#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#include <modbus.h>
#include <modbusDevice.h>
#include <modbusRegBank.h>
#include <modbusSlave.h>

#include "CONFIG.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// работа с MODBUS
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class ModbusHandler
{
  public:

    ModbusHandler();

    void setup();
    void begin();
    void update();


    modbusDevice* Bank() { return &mbusRegBank; }

    void setID(uint8_t id);

private:

  modbusDevice mbusRegBank;
  modbusSlave mbusSlave;


  void checkForChanges();
    
  
};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern ModbusHandler Modbus;
